Revit 2026 API

# InsulationTypeSetReverseIterator Method

---

Retrieve a backward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual InsulationTypeSetIterator ReverseIterator()
```
```vb
Public Overridable Function ReverseIterator As InsulationTypeSetIterator
```
```cpp
public:
virtual InsulationTypeSetIterator^ ReverseIterator()
```
```fsharp
abstract ReverseIterator : unit -> InsulationTypeSetIterator
override ReverseIterator : unit -> InsulationTypeSetIterator
```

#### Return Value

InsulationTypeSetIteratorReturns a backward moving iterator to the set.

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace